#include"def.h"

int main(void)
{
	int num;
while(num<3){
  	printf(" \n                    \n");
	printf("*********************学生选课管理系统*************************       \n");
	printf("     *********************************************     \n");
	printf("     * 1.学生信息管理       \n");
	printf("     *********************************************     \n");
	printf("     * 2.课程信息管理        \n");
	printf("     *********************************************     \n");
	printf("     * 3.退出系统          \n");
	printf("     *********************************************     \n");
	printf("     ----------------------------------------------------   \n");
	printf("请选择菜单编号:");
	scanf("%d", &num);
	switch(num){
		case (1):{
			s_menu();
			break;
		}
		case (2):{
			c_menu();
			break;
		}
		case (3):{
			printf("即将退出本系统！\n");
			break;
		}
	}
}
}
